[
  {
    "path": "posts/2021-03-12-introducing-guesstaurant-phl/",
    "title": "Introducing Guesstaurant PHL",
    "description": "A fun reminder of all the great Philly restaurants in game form.",
    "author": [
      {
        "name": "Tyler Tran",
        "url": {}
      }
    ],
    "date": "2021-03-12",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\nOne of the things I’ve been missing a lot during the pandemic is eating in restaurants. Sometimes I find myself panning through Google Maps just reminding myself of all the great spots around me. Luckily, many of them do takeout, but it’s not quite the same.\r\nI’ve created a Shiny app in R to make a little game out of the restaurant hunt! A friend from New York visited me in Philly a couple years ago, and she was looking at Google Maps for places to have dinner. She started reading some of the restaurant descriptions on the map, and we made a game out if it. She’d read a description, and I’d try to guess the restaurant. It’s a lot of descriptions like “hole in the wall,” “no-frills spot,” etc.\r\nDuring a year when many people haven’t been eating at restaurants and many restaurant workers have been struggling, I made Guesstaurant PHL because I think it’s fun and to provide a way for people to donate to restaurant workers if they’re able.\r\nTry it out at guesstaurantphl.com, and let me know what you think!\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-12-introducing-guesstaurant-phl/guesstaurant.png",
    "last_modified": "2021-03-12T21:48:38-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-26-where-are-all-the-fireplaces/",
    "title": "Where are all the fireplaces?",
    "description": "A holiday song by Sharon Jones takes me down a fiery path.",
    "author": [
      {
        "name": "Tyler Tran",
        "url": {}
      }
    ],
    "date": "2021-01-26",
    "categories": [],
    "contents": "\r\nI’m a big fan of Sharon Jones’ holiday album, and when I was listening last month, one song in particular got me thinking. After listening to “No Chimneys in the Projects,” I remembered that I had seen a column in the City’s property assessment data listing the number of fireplaces in buildings. I think of fireplaces as a luxury, especially somewhere in Philadelphia where few houses use wood as their primary source of heat. Given Philly’s abundance of historic buildings that might be more likely to have fireplaces than newer housing (or so I guessed) and this single column in the property assessment data, I thought I’d do a little digging.\r\nI downloaded the data from OpenDataPhilly and then did a little filtering; I removed any building that wasn’t single family housing, as the vast majority of recorded fireplaces are in single family homes (and single family housing makes up the majority of Philly’s residential buildings). I know for a fact that the dataset isn’t 100% accurate (I’ve been fortunate to live in an apartment with a fireplace, but it wasn’t recorded in the data).\r\nFrom a quick glance at the map below where the black dots symbolize fireplaces and pink areas represent the lowest-income census tracts in Philly, it’s clear that there isn’t much overlap. Most of the fireplaces appear to be concentrated in Northwest Philly and neighborhoods surrounding Center City. The pink parts of the map are based on median household income, which maybe isn’t the best metric for this. For example, University City is included in the pink area, where a lack of income for many students likely brings the median downward. Maybe next Christmas I’ll regenerate this with a more appropriate metric of poverty.\r\n\r\n\r\n\r\nIn a city as racially segregated as Philadelphia (just like many other cities in the US), there’s a lot of overlap between areas experiencing severe poverty and areas with a higher proportion of Black and brown residents. The side-by-side maps below show fireplaces on the left with a map of race and ethnicity on the right. This map was inspired by The Racial Dot Map created by Dustin Cable at the University of Virginia. While the UVA map shows a dot for each person recorded by the US Census, the map below shows one dot for every 10 people recorded by the American Community Survey. It generally appears that the areas with the highest concentration of fireplaces are also areas with higher concentration of white residents. One potential exception is in the area around Mount Airy, which appears to be a little less segregated than many other neighborhoods, and which seems to have a lot of fireplaces. More on that later!\r\n\r\n\r\n\r\nThe next step in my line of thinking was to look at the assessed market value of these homes with fireplaces compared to houses without fireplaces. Obviously there are tons of factors that could influence a property value assessment like size, neighborhood, age, amenities, and race of homeowners. I’m not going to get too deep into controlling for different factors that affect real estate, but I wanted to look at age of homes versus assessed market value in the context of fireplace prevalence. An abundance of appraisal appeals and an audit commissioned by the City have found that the Office of Property Assessment’s appraisal model is flawed. Additionally, many of the “year built” values are estimates. Given that market value and estimated construction year are two columns already in the dataset I was working with, that’s what I used, flaws and all.\r\nIn the graph below, each dot is a home in Philadelphia. Homes with fireplaces are colored red, and those without are colored gray. Unsurprisingly, there aren’t that many newer homes with lower assessed values and even fewer new homes with fireplaces with lower assessments.\r\n\r\n\r\n\r\nThinking about fireplaces with a temporal aspect made me wonder if the historic nature of Philadelphia might show up in trends in fireplaces that currently exist. My initial line of thinking was that maybe there’d be more fireplaces in Old City (or some other neighborhood with older buildings) given that using a fireplaces as a primary source of heat was more common historically than currently. But is there a temporal aspect that goes along with any spatial patterns? For example, do a higher proportion of houses built in the 19th Century have fireplaces than those built in the 20th Century? It’s difficult to make any conclusions like that, because houses might have been demolished or replaced, and this dataset reflects properties as they currently exist…but that didn’t completely cure my curiosity.\r\nI stumbled across a super interesting master’s thesis by Mathew Grubel titled “Central Changes in Domestic Heating: Lingering Traditions and New Technology in Philadelphia, 1690-1890”. The thesis is obviously more thouroughly-researched and thoughtful than a blogpost by a non-expert (me), and it inspired me to look into the “year built” variable in the dataset a little more. The animation below shows houses with fireplaces based on their estimated decade of construction. There are a few decades where it seems like fireplaces were more in fashion, but for the most part, these are decades with higher overall construction, and not just construction of houses with fireplaces.\r\n\r\n\r\n\r\nOn all the fireplace maps I made, Northwest Philly stood out to me because it has so many fireplaces compared to other parts of the city. Mathew Grubel’s thesis gave me a few ideas why that might be. Grubel talks about German influence in architecture in Philadelphia (and across Pennsylvania). “German closed stoves” became a common type of fireplace in Philadelphia, especially in the northwest around Germantown and Chestnut Hill where many German and Dutch families lived from the 17th Century onward.\r\nThough this dataset only includes houses that currently exist and not an inventory of all the houses throughout history, we can still look at fireplace prevlance across space and time in a way by using the year of construction. The heatmap below shows a few neighborhoods I selected and the proportion of single family homes built in that decade that have a fireplace. The proportions range from 0% of homes to 62% of homes (Chestnut Hill in the early 20th Century). If a square is dark gray, that means there are no single family homes currently recorded as having been built in a particular decade. The prevalence of dark gray boxes in many of the neighborhoods towards the bottom of the heatmap really speaks to the disinvestment in those neighborhoods in the 1980s and 1990s (and today). Unsurprisingly, those neighborhoods have higher proportions of Black residents and deeper poverty than many of the neighborhoods higher on the heatmap.\r\n\r\n\r\n\r\n\r\n\r\n\r\nIn a nod to Grubel’s thesis on the history of domestic heating in Philadelphia, I re-created one of his graphs using somewhat similar current-day data. The top graph below is a plot from his 1998 thesis showing the primary form of heating for homes by decade. My graph underneath it isn’t an exact update: rather than longitudinal data, the decades on my graph represent the decade of a house’s construction, and the houses included are only those that currently exist in 2021.\r\n\r\n\r\n\r\n\r\n\r\n\r\nI hope you enjoyed this journey into Philadelphia’s fireplaces through the lens of open data! If you get nothing else out of this post, I hope that you’ll listen to some Sharon Jones (rest in peace), as she’s the one who got my wheels turning originally.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-26-where-are-all-the-fireplaces/where-are-all-the-fireplaces_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-02-03T18:44:19-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-24-what-does-housing-look-like-in-different-philly-neighborhoods/",
    "title": "What does housing look like in different Philly neighborhoods?",
    "description": "A look at what residential buildings look like across Philadelphia, from detached single family homes to multi-unit high-rise apartments.",
    "author": [
      {
        "name": "Tyler Tran",
        "url": {}
      }
    ],
    "date": "2019-03-02",
    "categories": [],
    "contents": "\r\nA few years back, the Washington Post published a visualization of Census data showing differences in housing in different large cities across the US. This was updated by Munson’s City, and both reports show the stunning abundance of single-family housing in American cities. Nationally, more than 60% of housing is detached single-family housing, and in more than half of the 50 largest US cities, single-family housing prevails as the dominant home type.\r\nWhile cities such as New York and Boston are mostly made up of multi-family housing (in both cities, less than 20% of housing is single-family), data from Philadelphia show that it is truly a city of rowhomes. Philly and Baltimore are the only two cities analyzed with a majority of housing being single-family attached, or rowhomes. A prevalence of single-family housing in cities has implications in housing affordability, and many point to a lack of mid-density housing (or, the “Missing Middle”) as a threat to walkability and affordability.\r\nRecognizing Philly as an outlier in the WaPo article, I decided to take a closer look at Philadelphia housing at the neighborhood scale. I re-created their visualization using US Census Bureau American Community Survey (2015-2019) data with Azavea’s definitions of Philly neighborhoods (though I realize these boundaries might be fluid and/or questionable to some). In the figure below, I show the 20 neighborhoods with the least single-family housing and the 20 neighborhoods with the most single-family housing. In between these two groups of extremes, you’ll find citywide numbers where, according to the most recent ACS numbers, about 65% of housing is single-family housing (but a relatively dense stock of single-family housing!).\r\n\r\n\r\nShow code\r\n\r\n# Housing type\r\n# Jan 2021 -- Re-writing code from March 2019\r\n\r\nlibrary(tidyverse); library(sf); library(tidycensus); library(showtext)\r\n\r\n#########################################################################\r\n# Set up fonts\r\n\r\nfont_add_google('Merriweather')\r\nfont_add_google('Source Sans Pro', 'ssp')\r\n\r\nshowtext_auto()\r\n\r\nfont_theme <- theme(\r\n  plot.title = element_text(family = 'Merriweather', face = 'bold'),\r\n  plot.subtitle = element_text(family = 'ssp'),\r\n  axis.text = element_text(family = 'ssp'),\r\n  axis.title = element_text(family = 'ssp'),\r\n  legend.text = element_text(family = 'ssp'),\r\n  plot.caption = element_text(family = 'ssp', color = 'darkgray')\r\n)\r\n#########################################################################\r\n\r\n\r\ncensus_api_key(Sys.getenv('census_api'))\r\n\r\n\r\n# Get Azavea neighborhoods\r\nneighborhoods <- st_read('https://raw.githubusercontent.com/azavea/geo-data/master/Neighborhoods_Philadelphia/Neighborhoods_Philadelphia.geojson')\r\n\r\n\r\n# Get housing type data from ACS\r\nhousing_type <- get_acs(geography = 'block group',\r\n                        table = 'B25024',\r\n                        state = 'PA',\r\n                        county = 'Philadelphia',\r\n                        year = 2019,\r\n                        geometry = T) %>%\r\n  mutate(label = case_when(\r\n    variable == 'B25024_001' ~ 'Total',\r\n    variable == 'B25024_002' ~ 'Single family detached',\r\n    variable == 'B25024_003' ~ 'Single family attached',\r\n    variable == 'B25024_004' ~ '2 units',\r\n    variable %in% c('B25024_005', 'B25024_006') ~ '3 to 9 units',\r\n    variable == 'B25024_007' ~ '10 to 19 units',\r\n    variable == 'B25024_008' ~ '20 to 49 units',\r\n    variable == 'B25024_009' ~ '50+ units',\r\n    variable == 'B25024_010' ~ 'Other'\r\n  )) %>%\r\n  st_transform(crs = st_crs(neighborhoods)) %>%\r\n  st_join(neighborhoods, join = st_intersects) %>%\r\n  group_by(mapname) %>%\r\n  summarise(n = sum(estimate[label == 'Total'], na.rm = T),\r\n            `Single family detached` = sum(estimate[label == 'Single family detached'], na.rm = T)/n,\r\n            `Single family attached` = sum(estimate[label == 'Single family attached'], na.rm = T)/n,\r\n            `2 units` = sum(estimate[label == '2 units'], na.rm = T)/n,\r\n            `3 to 9 units` = sum(estimate[label == '3 to 9 units'], na.rm = T)/n,\r\n            `10 to 19 units` = sum(estimate[label == '10 to 19 units'], na.rm = T)/n,\r\n            `20 to 49 units` = sum(estimate[label == '20 to 49 units'], na.rm = T)/n,\r\n            `50+ units` = sum(estimate[label == '50+ units'], na.rm = T)/n,\r\n            Other = sum(estimate[label == 'Other'], na.rm = T)/n) %>%\r\n  as_tibble() %>%\r\n  mutate(total_p_sfh = `Single family detached` + `Single family attached`)\r\n\r\n\r\nsfh_20_most <- housing_type %>%\r\n  top_n(20, total_p_sfh)\r\n\r\nsfh_20_least <- housing_type %>%\r\n  top_n(-20, total_p_sfh)\r\n\r\ncitywide <- get_acs(geography = 'county',\r\n                    table = 'B25024',\r\n                    state = 'PA',\r\n                    county = 'Philadelphia',\r\n                    year = 2019) %>%\r\n  mutate(label = case_when(\r\n    variable == 'B25024_001' ~ 'Total',\r\n    variable == 'B25024_002' ~ 'Single family detached',\r\n    variable == 'B25024_003' ~ 'Single family attached',\r\n    variable == 'B25024_004' ~ '2 units',\r\n    variable %in% c('B25024_005', 'B25024_006') ~ '3 to 9 units',\r\n    variable == 'B25024_007' ~ '10 to 19 units',\r\n    variable == 'B25024_008' ~ '20 to 49 units',\r\n    variable == 'B25024_009' ~ '50+ units',\r\n    variable == 'B25024_010' ~ 'Other'\r\n  )) %>%\r\n  summarise(mapname = 'Citywide',\r\n            n = sum(estimate[label == 'Total'], na.rm = T),\r\n            `Single family detached` = sum(estimate[label == 'Single family detached'], na.rm = T)/n,\r\n            `Single family attached` = sum(estimate[label == 'Single family attached'], na.rm = T)/n,\r\n            `2 units` = sum(estimate[label == '2 units'], na.rm = T)/n,\r\n            `3 to 9 units` = sum(estimate[label == '3 to 9 units'], na.rm = T)/n,\r\n            `10 to 19 units` = sum(estimate[label == '10 to 19 units'], na.rm = T)/n,\r\n            `20 to 49 units` = sum(estimate[label == '20 to 49 units'], na.rm = T)/n,\r\n            `50+ units` = sum(estimate[label == '50+ units'], na.rm = T)/n,\r\n            Other = sum(estimate[label == 'Other'], na.rm = T)/n) %>%\r\n  mutate(total_p_sfh = `Single family detached` + `Single family attached`)\r\n\r\n\r\np_housing_types <- bind_rows(\r\n  sfh_20_least,\r\n  sfh_20_most,\r\n  citywide\r\n) %>%\r\n  select(-n, -geometry) %>%\r\n  pivot_longer(c(-mapname, -total_p_sfh), names_to = 'category', values_to = 'p_category') %>%\r\n  mutate(category = factor(category, \r\n                           levels = rev(c('Single family detached', 'Single family attached',\r\n                                      '2 units', '3 to 9 units', '10 to 19 units',\r\n                                      '20 to 49 units', '50+ units', 'Other'))))\r\n\r\n# Kinda janky way to fix spacing in legend\r\n# https://stackoverflow.com/questions/50883294/increasing-whitespace-between-legend-items-in-ggplot2/50885122\r\nstr_pad_custom <- function(labels){\r\n  new_labels <- paste0(labels, '       ')\r\n  return(new_labels)\r\n}\r\n\r\nmy_palette <- rev(c('#e3ced3', '#aa82a8', '#6da18f', '#335b8e', \r\n                '#b7dbdb', '#faed55', '#687e4f', '#424242'))\r\nbold_citywide <- c(rep('plain', 20), 'bold.italic', rep('plain', 20))\r\n\r\n# Make plot of housing types by neighborhood\r\np_housing_types %>%\r\n  ggplot(aes(fill = category, y = p_category, x = reorder(mapname, -total_p_sfh))) +\r\n  geom_bar(position = 'stack', stat = 'identity') +\r\n  geom_hline(yintercept = c(0.25, 0.5, 0.75), linetype = 'dotted') +\r\n  geom_hline(yintercept = 0) +\r\n  labs(x = '', y = '', fill = '',\r\n       title = 'What does housing look like in different Philly neighborhoods?', \r\n       subtitle = 'Housing by Building Type',\r\n       caption = 'Source: ACS 2015-2019 5-year estimates') +\r\n  scale_y_continuous(expand = c(0, 0), breaks = c(0.25, 0.5, 0.75),\r\n                     labels = c('25%', '50%', '75%')) +\r\n  scale_fill_manual(values = my_palette, labels = str_pad_custom) +\r\n  coord_flip() +\r\n  theme(\r\n    legend.position = 'bottom',\r\n    plot.title = element_text(size = 15),\r\n    plot.subtitle = element_text(size = 13),\r\n    axis.text = element_text(size = 10.5),\r\n    axis.text.y = element_text(face = bold_citywide),\r\n    legend.spacing.x = unit(0.01, 'cm'),\r\n    axis.ticks.x = element_line(linetype = 'dotted'),\r\n    axis.ticks.y = element_blank(),\r\n    panel.background = element_blank(),\r\n    panel.grid = element_blank()\r\n  ) +\r\n  font_theme +\r\n  guides(fill = guide_legend(nrow = 1, reverse = T))\r\n\r\n\r\n\r\n\r\nIt’ll be interesting to take another look at this in a couple years, as I suspect data from some neighborhoods will reflect an emphasis on multi-family housing in development, and maybe some in the “missing middle.”\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-24-what-does-housing-look-like-in-different-philly-neighborhoods/what-does-housing-look-like-in-different-philly-neighborhoods_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-01-25T18:40:34-05:00",
    "input_file": {}
  }
]
